Revit 2027 API
RevitLinkType.PathType Property
 The type of path the link uses.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PathType PathType { get; set; }
Public Property PathType As PathType
	Get
	Set
public:
property PathType PathType {
	PathType get ();
	void set (PathType value);
}
member PathType : PathType with get, set
Property Value
PathType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The PathType of the Revit link cannot be determined (or set), because it was not loaded from a local disk drive or from Revit Server. -or- When setting this property: The PathType for the link is not valid. PathType.Content is never valid for a Revit link. To change the type to or from PathType.Server, use RevitLinkType.LoadFrom and pick a server or file path. -or- When setting this property: This operation is not supported for scenario-based Revit links. Scenario-based Revit links are read-only and their source is managed by the scenario system.
Remarks
You cannot change the PathType to or from PathType.Server. The path type will change automatically if you call RevitLinkType.LoadFrom with a Revit Server path.
Links from external resource servers are considered to have no path type. Attempts to access this property for an external server link will result in an exception.
Setting this property is blocked for Revit links that originate from a scenario. Scenario-based Revit links are read-only and cannot have their path type changed.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace